# PANDAS ASSIGNMENT

In [1]:
import pandas as pd

In [2]:
# q.1
lst = [10,20,30,40]
lst

[10, 20, 30, 40]

In [3]:
l = pd.Series(lst)
l

0    10
1    20
2    30
3    40
dtype: int64

In [4]:
# q.2
l[2]

np.int64(30)

In [5]:
# q.3
l[0:3]

0    10
1    20
2    30
dtype: int64

In [6]:
# q.4
l.index = ["a","b","c","d"]
l

a    10
b    20
c    30
d    40
dtype: int64

In [7]:
# q.5
l["b"] =50
l

a    10
b    50
c    30
d    40
dtype: int64

In [8]:
# q.6 
dic = {'Delhi': 1, 'Jaipur': 2,'Chennai': 3, 'Surat': 4, 'Agra': 5}
dic

{'Delhi': 1, 'Jaipur': 2, 'Chennai': 3, 'Surat': 4, 'Agra': 5}

In [9]:
d = pd.Series(dic)
d

Delhi      1
Jaipur     2
Chennai    3
Surat      4
Agra       5
dtype: int64

In [10]:
# q.7
d["Delhi"]

np.int64(1)

In [11]:
d[1:4]

Jaipur     2
Chennai    3
Surat      4
dtype: int64

In [12]:
# q.8
import numpy as np

In [13]:
dt = np.arange(0,4).reshape(2,2)
dt

array([[0, 1],
       [2, 3]])

In [14]:
df = pd.DataFrame(dt,columns = ['a','b'])
df

   a  b
0  0  1
1  2  3

In [15]:
# q.9
df[1:]

   a  b
1  2  3

In [16]:
# 10
f = [[3,4]]
f

[[3, 4]]

In [17]:
df['c'] = [4,5]

In [18]:
df

   a  b  c
0  0  1  4
1  2  3  5

In [19]:
df["c"]

0    4
1    5
Name: c, dtype: int64

In [22]:
c = df.drop(columns = "b")
c

   a  c
0  0  4
1  2  5

## Pandas Assignment 2 (29/10/2024)

In [1]:
import pandas as pd
import numpy as np

In [3]:
years = [2021, 2022]
quarters = ['Q1', 'Q2', 'Q3', 'Q4']
multi_index = pd.MultiIndex.from_product([years, quarters], names=["Year", "Quarter"])
multi_index

MultiIndex([(2021, 'Q1'),
            (2021, 'Q2'),
            (2021, 'Q3'),
            (2021, 'Q4'),
            (2022, 'Q1'),
            (2022, 'Q2'),
            (2022, 'Q3'),
            (2022, 'Q4')],
           names=['Year', 'Quarter'])

In [5]:
columns = pd.MultiIndex.from_product([['Sales', 'Expenses'], ['Online', 'In-Store']], names=['Metric', 'Channel'])
columns

MultiIndex([(   'Sales',   'Online'),
            (   'Sales', 'In-Store'),
            ('Expenses',   'Online'),
            ('Expenses', 'In-Store')],
           names=['Metric', 'Channel'])

In [6]:
np.random.seed(0)  # Set seed for reproducibility
data = np.random.randint(5000, 20000, size=(len(multi_index), len(columns)))

In [7]:
data

array([[ 7732, 15799, 14845,  8264],
       [18123,  9859, 19019, 14225],
       [12891,  9373, 10874, 19116],
       [19935, 11744,  8468, 19650],
       [ 5705,  7599, 15327,  7222],
       [12768,  7897, 14893,  5537],
       [16085, 11216, 11921, 11036],
       [ 7163, 10072,  9851, 12877]], dtype=int32)

In [8]:
financial_data = pd.DataFrame(data, index=multi_index, columns=columns)
financial_data

Metric        Sales          Expenses
Channel      Online In-Store   Online In-Store
Year Quarter
2021 Q1        7732    15799    14845     8264
     Q2       18123     9859    19019    14225
     Q3       12891     9373    10874    19116
     Q4       19935    11744     8468    19650
2022 Q1        5705     7599    15327     7222
     Q2       12768     7897    14893     5537
     Q3       16085    11216    11921    11036
     Q4        7163    10072     9851    12877

In [21]:
# a) What are the online sales for Q1 2022?
a = financial_data.loc[(2022,'Q1'),('Sales','Online')]
a

np.int32(5705)

In [22]:
# b) How much were the in-store expenses in Q3 2021?
b = financial_data.loc[(2021,'Q3'),('Expenses','In-Store')]
b

np.int32(19116)

In [23]:
# c) What are the total sales for Q4 2021?
c = financial_data.loc[(2021, 'Q4'), 'Sales'].sum()
c

np.int64(31679)

In [26]:
# d) What were the expenses for the online channel in 2022?
d = financial_data.loc[(2022),('Expenses','Online')]
d

Quarter
Q1    15327
Q2    14893
Q3    11921
Q4     9851
Name: (Expenses, Online), dtype: int32

In [27]:
# e) Retrieve sales data for Q2 2021.
e = financial_data.loc[(2021, 'Q2'), 'Sales']
e

Channel
Online      18123
In-Store     9859
Name: (2021, Q2), dtype: int32

In [28]:
# f) What is the maximum expense recorded in 2022?
f = financial_data.loc[2022, 'Expenses'].max().max()
f

np.int32(15327)

In [33]:
# 2) Stack a DataFrame of Store, Product, and Sales
data = {
    'Store': ['A', 'A', 'B', 'B'],
    'Product': ['X', 'Y', 'X', 'Y'],
    'Sales': [200, 150, 250, 300]
}
df = pd.DataFrame(data).set_index(['Store', 'Product'])
stacked_df = df.stack()

In [34]:
stacked_df

Store  Product
A      X        Sales    200
       Y        Sales    150
B      X        Sales    250
       Y        Sales    300
dtype: int64

In [35]:
# 3) Unstack it to show sales by store
stacked_df.unstack(level=0)

Store            A    B
Product
X       Sales  200  250
Y       Sales  150  300

In [37]:
# 4) Create a multi-index with Department and Role
index1 = pd.MultiIndex.from_product([['HR', 'Finance', 'IT'], ['Manager', 'Analyst']], names=['Department', 'Role'])
employee_data = pd.DataFrame(np.random.randint(3000, 7000, size=(len(index1), 1)), index=index1, columns=['Salary'])

In [38]:
employee_data

                    Salary
Department Role
HR         Manager    5046
           Analyst    4871
Finance    Manager    6503
           Analyst    5496
IT         Manager    5898
           Analyst    3099

In [39]:
# 5) Access employees from a specific department.
employee_data.loc['HR']

         Salary
Role
Manager    5046
Analyst    4871

In [40]:
# 6) Sort a DataFrame of student grades by Subject and Grade
grades_data = {
    'Student': ['Alice', 'Bob', 'Charlie', 'David'],
    'Subject': ['Math', 'Science', 'Math', 'Science'],
    'Grade': [85, 90, 95, 88]
}
grades_df = pd.DataFrame(grades_data).sort_values(['Subject', 'Grade'])

In [41]:
grades_df

   Student  Subject  Grade
0    Alice     Math     85
2  Charlie     Math     95
3    David  Science     88
1      Bob  Science     90

In [42]:
# 7) Reset the index of the sorted grades
grades_df.reset_index(drop=True)

   Student  Subject  Grade
0    Alice     Math     85
1  Charlie     Math     95
2    David  Science     88
3      Bob  Science     90

In [45]:
# 8) Set the Date column as the index in a weather DataFrame
weather_data = {
    'Date': pd.date_range(start='2023-01-01', periods=5, freq='D'),
    'Temperature': [23, 21, 19, 22, 20],
    'Humidity': [68, 70, 65, 75, 72]
}
weather_df = pd.DataFrame(weather_data).set_index('Date')
weather_df

            Temperature  Humidity
Date
2023-01-01           23        68
2023-01-02           21        70
2023-01-03           19        65
2023-01-04           22        75
2023-01-05           20        72

In [47]:
# 9) Flatten a multi-index DataFrame of product sales
multi_index_data = pd.DataFrame(np.random.randint(100, 500, size=(4, 4)), 
                                index=pd.MultiIndex.from_product([['Category1', 'Category2'], ['ProductA', 'ProductB']], names=['Category', 'Product']),
                                columns=['Q1', 'Q2', 'Q3', 'Q4'])
flattened_df = multi_index_data.reset_index()
flattened_df

    Category   Product   Q1   Q2   Q3   Q4
0  Category1  ProductA  470  283  128  390
1  Category1  ProductB  228  228  153  489
2  Category2  ProductA  138  344  373  435
3  Category2  ProductB  488  205  142  131

In [54]:
# 10) Create a multi-index using Category and Product in a product DataFrame, then average the levels in the column
product_data = pd.DataFrame({
    'Category': ['Electronics', 'Electronics', 'Furniture', 'Furniture'],
    'Product': ['Laptop', 'Tablet', 'Chair', 'Table'],
    'Price': [1000, 500, 150, 200]
})
product_df = product_data.set_index(['Category', 'Product'])
product_df.groupby(level=['Category']).mean()

             Price
Category
Electronics  750.0
Furniture    175.0